In [14]:
import pandas as pd
import time

In [ ]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})
start=time.time()
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

end=time.time()
rs=end-start
print(rs)
employees

In [4]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [11]:
pd.merge(employees,departments,on="DeptID")#inner join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [6]:
pd.merge(employees,departments,on="DeptID",how="left")#inner join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [7]:
pd.merge(employees,departments,on="DeptID",how="right")#inner join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [24]:
pd.merge(employees,departments,on="DeptID",how="outer")#outer join

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [29]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"Score":[19,876]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"],"Age":[89,9]})

# pd.concat([df1, df2])

In [30]:
df1

    Name  Score
0  Alice     19
1    Bob    876

In [31]:
df2

      Name  Age
0  Charlie   89
1    David    9

In [34]:
pd.concat([df1,df2],axis=0)

      Name  Score   Age
0    Alice   19.0   NaN
1      Bob  876.0   NaN
0  Charlie    NaN  89.0
1    David    NaN   9.0